Revit 2026 API

# HostObjectUtils Class

---

These are generic host object utilities.

SystemObject Autodesk.Revit.DBHostObjectUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class HostObjectUtils
```
```vb
Public NotInheritable Class HostObjectUtils
```
```cpp
public ref class HostObjectUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HostObjectUtils = class end
```

The HostObjectUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBottomFaces | Returns the bottom faces for this host object. |
|  | GetSideFaces | Returns the major side faces for this host object. |
|  | GetTopFaces | Returns the top faces for this host object. |

#### Reference

Autodesk.Revit.DB Namespace